{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embedding37_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3816, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding37_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "3816", 
        "output_dim": "1", 
        "sparse_grad": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "_np_sum", 
      "name": "deepfm18_sum2", 
      "attrs": {
        "axis": "1", 
        "keepdims": "False"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense90_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, -1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense90_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense90_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embedding36_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3816, 10)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding36_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "3816", 
        "output_dim": "10", 
        "sparse_grad": "False"
      }, 
      "inputs": [[0, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "_np_sum", 
      "name": "deepfm18_sum0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_npi_power_scalar", 
      "name": "deepfm18_power_scalar0", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "_npi_power_scalar", 
      "name": "deepfm18_power_scalar1", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_np_sum", 
      "name": "deepfm18_sum1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_npi_subtract", 
      "name": "deepfm18_subtract0", 
      "inputs": [[10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "_np_sum", 
      "name": "deepfm18_sum3", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "_npi_multiply_scalar", 
      "name": "deepfm18_multiply_scalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "deepfm18_add0", 
      "inputs": [[6, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "_np_reshape", 
      "name": "deepfm18_reshape0", 
      "attrs": {"newshape": "(-1, 340)"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense91_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30, 340)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense91_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense91_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "30"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense91_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout54_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense92_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(20, 30)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense92_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(20,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense92_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "20"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense92_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout55_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense93_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(10, 20)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense93_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(10,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense93_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense93_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout56_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense94_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 10)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense94_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense94_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "deepfm18_add1", 
      "inputs": [[16, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "_npx_sigmoid", 
      "name": "deepfm18_sigmoid0", 
      "inputs": [[36, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    4, 
    5, 
    7, 
    18, 
    19, 
    23, 
    24, 
    28, 
    29, 
    33, 
    34
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    24, 
    25, 
    26, 
    27, 
    28, 
    30, 
    31, 
    32, 
    33, 
    34, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41
  ], 
  "heads": [[37, 0, 0]], 
  "attrs": {
    "is_np_shape": ["int", 1], 
    "mxnet_version": ["int", 10600]
  }
}